blog_app/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("name", "title", "content") VALUES ($1, $2, $3) RETURNING "id"  [["name", "2"], ["title", "2"], ["content", "2"]]
---
  def create
    @blog = Blog.new(blog_params)
    if @blog.save

UPDATE "blogs" SET "content" = $1 WHERE "blogs"."id" = $2  [["content", "33"], ["id", 5]]
---
  def update
    if @blog.update(blog_params)